### Pandas Overview

Pandas will be a major tool of interest throughout much of the rest of the book. It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python.

In [2]:
import pandas as pd
import numpy as np

### Series
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.
The simplest Series is formed from only an array of data:

In [2]:
obj = pd.Series([4, 5, -7, 3])

In [3]:
obj

0    4
1    5
2   -7
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  5, -7,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# Create a series with index(label)
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2[obj2> 2]

d    4
b    7
c    3
dtype: int64

In [10]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [13]:
np.sum(obj2)

9

In [14]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
# Create a series with index using dictionary
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [18]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
# over-riding the order by passing the index
states = ["California", "Ohio", "Utah"]
obj4 = pd.Series(obj3, index=states)

In [23]:
# you can notice the missing values will be automatically imputed by NA's
obj4

California        NaN
Ohio          35000.0
Utah           5000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Utah          False
dtype: bool

In [27]:
# add two series obj3 & obj4. Only the common values will be added
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah          10000.0
dtype: float64

## Problem
Create Series containing the data in series. Usecase: Declare each index as Train no. and the table contains the information about the Train including the 
1. Train Name.
2. no_of_coaches

Note: Add a New, Train data by using the '+' operator after creating the Table.

In [47]:
t_names = {"Sathapathi express": 21 , "Pallavan express": 18}

In [48]:
train_series = pd.Series(t_names)
train_series

Sathapathi express    21
Pallavan express      18
dtype: int64

In [61]:
new_train = pd.Series({"Nellai Express": 18}, dtype=int)
new_train

Nellai Express    18
dtype: int64

In [64]:
# add new train data
new_train.append(train_series)

/tmp/ipykernel_22724/613857773.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_train.append(train_series)

Nellai Express        18
Sathapathi express    21
Pallavan express      18
dtype: int64

## DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collec‚Äê
tion of columns, each of which can be a different value type

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)

In [4]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
# Numpy operation for calc
df.values[0:, 1:]* 2

array([[4000, 3.0],
       [4002, 3.4],
       [4004, 7.2],
       [4002, 4.8],
       [4004, 5.8],
       [4006, 6.4]], dtype=object)

In [16]:
# find the sum
np.sum(df.values[0:, 1:])

12024.300000000001

In [69]:
# index passed
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [72]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [71]:
type(frame2["state"])

pandas.core.series.Series

In [74]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [76]:
frame2.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [79]:
# The . operator will work only if the column name is the valid python name - 
# here pop() is the reserved method in python
frame2.pop

<bound method DataFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

In [80]:
# Access the rows
frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [81]:
# Assign value throughout the column
frame2["debt"] = 16.5

In [82]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [83]:
frame2.debt = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [84]:
# create a series to insert only to particular indexes
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [86]:
frame2["debt"] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [87]:
# Add a new column boolean
frame2["eastern"] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [89]:
# Delete the column eastern
del frame2["eastern"]

In [90]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [91]:
# Nested dict to create dataframe
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)

In [93]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [94]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [96]:
# Arrange with index
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [97]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [98]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [99]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [100]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [101]:
frame3.index

Int64Index([2001, 2002, 2000], dtype='int64', name='year')

In [105]:
2000 in frame3.index; 2002 in frame3.index

True

## Flat files reading with Pandas

In [131]:
import json

In [132]:
with open("./data/data.json", 'r') as file:
    data = json.loads(file.read())

In [134]:
pd.DataFrame(data)

   Name  Age         DOB
0  Arun   23  10-10-1999
1  Raja   47  11-12-1990

In [135]:
# Read a CSV
sales_data = pd.read_csv("./data/sales-data-sample.csv")
sales_data.head()

,OrderDate,Category,City,Country,CustomerName,Discount,OrderID,PostalCode,ProductName,Profit,...,DaystoShipActual,SalesForecast,ShipStatus,DaystoShipScheduled,OrderProfitable,SalesperCustomer,ProfitRatio,SalesaboveTarget,latitude,longitude
0,2011-01-04T00:00:00.000Z,Office Supplies,Houston,United States,Darren Powers,0.2,CA-2011-103800,77095,"Message Book, Wirebound, Four 5 1/2 X 4 Forms/...",6,...,4,22,Shipped Early,6,NaN,16.45,33.8,NaN,29.8941,-95.6481
1,2011-01-05T00:00:00.000Z,Office Supplies,Naperville,United States,Phillina Ober,0.2,CA-2011-112326,60540,Avery 508,4,...,4,15,Shipped Early,6,NaN,11.78,36.3,NaN,41.7662,-88.1410
2,2011-01-05T00:00:00.000Z,Office Supplies,Naperville,United States,Phillina Ober,0.8,CA-2011-112326,60540,GBC Standard Plastic Binding Systems Combs,-5,...,4,5,Shipped Early,6,NaN,3.54,-155.0,NaN,41.7662,-88.1410
3,2011-01-05T00:00:00.000Z,Office Supplies,Naperville,United States,Phillina Ober,0.2,CA-2011-112326,60540,SAFCO Boltless Steel Shelving,-65,...,4,357,Shipped Early,6,NaN,272.74,-23.8,NaN,41.7662,-88.1410
4,2011-01-06T00:00:00.000Z,Office Supplies,Philadelphia,United States,Mick Brown,0.2,CA-2011-141817,19143,Avery Hi-Liter EverBold Pen Style Fluorescent ...,5,...,7,26,Shipped Late,6,NaN,19.54,25.0,NaN,39.9448,-75.2288

In [139]:
tennis_df = pd.read_excel("./data/tennis_schedule.xlsx")
tennis_df

   Id      Time      Team1       Team2  court
0   1  10:30:00          A           B      1
1   2  11:40:00          C           D      2
2   3  12:15:00          A           C      4
3   4  12:15:00          D           A      5
4   5  14:00:00  Winner -1  Runner ‚Äì 1      2
5   6  15:00:00  Winner -2  Runner ‚Äì 2      1
6   7  16:00:00  Winner -1  Winner ‚Äì 2      3

## Reindexing

In [107]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [109]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [110]:
## ffill - forward fills the values
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [111]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [132]:
# create a marks array
marks = np.array([np.random.randint(20, 100) for i in range(15)]).reshape(3, 5)
marks

array([[25, 37, 63, 86, 81],
       [48, 90, 73, 49, 38],
       [26, 26, 59, 86, 92]])

In [135]:
## Create a dataframe using the numpy array and reshaping with index and column names
student_df = pd.DataFrame(marks, columns=["English", "Social", "Science", "Tamil", "Maths"], 
                          index=["Arun", "Bob", "Christy"])
student_df

         English  Social  Science  Tamil  Maths
Arun          25      37       63     86     81
Bob           48      90       73     49     38
Christy       26      26       59     86     92

In [155]:
add_new_student = pd.DataFrame({"English": 23, "Social": 53, "Science": 43, "Tamil": 32, "Maths": 21}, index=["Dinesh"])

In [163]:
student_df.append(add_new_student)

/tmp/ipykernel_22724/1509899634.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  student_df.append(add_new_student)

         English  Social  Science  Tamil  Maths
Arun          25      37       63     86     81
Bob           48      90       73     49     38
Christy       26      26       59     86     92
Dinesh        23      53       43     32     21

In [175]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
            columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [176]:
data.drop(['Colorado', 'Ohio'], axis=0, inplace=True)
data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
data.drop("two", axis=1, inplace=True)
data

          one  three  four
Utah        8     10    11
New York   12     14    15

## Indexing, Selection, and Filtering

In [178]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [179]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [180]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [181]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [183]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [184]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [185]:
type(data['two'])

pandas.core.series.Series

In [186]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [187]:
type(data[['three', 'one']])

pandas.core.frame.DataFrame

In [188]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [191]:
# Filter greater than 5 . using column three
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [197]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection with loc and iloc

In [193]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [195]:
# select a single row and multiple columns by label:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [196]:
# perform some similar selections with integers using iloc
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [198]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [200]:
df = data.iloc[[1, 2], [3, 0, 1]]
df

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [201]:
type(df)

pandas.core.frame.DataFrame

In [203]:
# loc to select the column
data.loc[:"Utah", ['two', 'three']]

          two  three
Ohio        0      0
Colorado    5      6
Utah        9     10

In [212]:
# iloc to select the column
data.iloc[0:3, 1:3]

          two  three
Ohio        0      0
Colorado    5      6
Utah        9     10

## Integer Indexes

In [214]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [215]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [221]:
ser[:1]

0    0.0
dtype: float64

In [218]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and Data Alignment

In [222]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [223]:
s1, s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64,
 a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [224]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [225]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [226]:
df1+ df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [229]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'A': [3, 4]})
df2 - df1

   A
0  2
1  2

In [230]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df2-df1

    A   B
0 NaN NaN
1 NaN NaN

## Arithmetic methods with fill values

In [233]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [237]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [234]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [235]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [238]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [239]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [242]:
# Re-index to fill new index and value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## Broadcasting the series to mathematical operations

In [248]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), 
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [249]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [251]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [252]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [253]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

## Function Application and Mapping

In [4]:
# Apply and apply map
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])

In [5]:
# how to use apply
def custom_sum(row):
    return row.sum()
df['D'] = df.apply(custom_sum, axis=1)

In [6]:
df

       A   B   C    D
Row 1  1  10  20   31
Row 2  2  20  40   62
Row 3  3  30  60   93
Row 4  4  40  80  124

In [14]:
df_new = pd.concat([df, pd.DataFrame({"A": 5, "B": 50, "C": 100, "D": np.nan}, index=["Row 5"])])
df_new

       A   B    C      D
Row 1  1  10   20   31.0
Row 2  2  20   40   62.0
Row 3  3  30   60   93.0
Row 4  4  40   80  124.0
Row 5  5  50  100    NaN

In [16]:
# apply to row the custom sum
df.loc["Row 5"] = df.apply(lambda x: x.sum(), axis=0)

In [17]:
df

        A    B    C    D
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row 5  10  100  200  310

In [18]:
# Multi-column operation with result_type paramater 'expand' & 'reduce'
def cal_multi_col(row):
    return [row['A'] * 2, row['B'] * 3]

In [20]:
res = df.apply(cal_multi_col, axis=1, result_type='expand')
df[res.columns] = res

In [21]:
df

        A    B    C    D   0    1
Row 1   1   10   20   31   2   30
Row 2   2   20   40   62   4   60
Row 3   3   30   60   93   6   90
Row 4   4   40   80  124   8  120
Row 5  10  100  200  310  20  300

In [22]:
df['New'] = df.apply(cal_multi_col, axis=1, result_type='reduce')

In [23]:
df

        A    B    C    D   0    1        New
Row 1   1   10   20   31   2   30    [2, 30]
Row 2   2   20   40   62   4   60    [4, 60]
Row 3   3   30   60   93   6   90    [6, 90]
Row 4   4   40   80  124   8  120   [8, 120]
Row 5  10  100  200  310  20  300  [20, 300]

#### Problem pandas apply round off the digits to 2 decimal places & also apply condition 0 if the values are less than 0
Using the below data frame 

```Python
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
```

In [24]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.155525 -0.741516 -0.504044
Ohio   -1.754077  0.102690 -0.955091
Texas   1.453742  0.566079  0.911614
Oregon -1.199236 -0.220205 -1.480748

In [32]:
def zer_fun(x):
    if x <= 0:
        return 0
    else:
        return x

In [34]:
frame.applymap(zer_fun)

               b         d         e
Utah    1.155525  0.000000  0.000000
Ohio    0.000000  0.102690  0.000000
Texas   1.453742  0.566079  0.911614
Oregon  0.000000  0.000000  0.000000

In [256]:
np.abs(frame)

               b         d         e
Utah    0.756929  2.203183  1.471213
Ohio    0.113657  1.008180  1.088937
Texas   0.863541  0.676567  0.212310
Oregon  0.767188  1.139585  0.340041

In [261]:
f = lambda x: x.max() - x.min()

In [270]:
frame.apply(f, axis=1)

Utah      3.674396
Ohio      0.975280
Texas     0.651232
Oregon    1.479626
dtype: float64

In [271]:
format_type = lambda x: '%.2f' % x

In [274]:
# element-wise applymap is the method used
frame.applymap(format_type)

            b      d      e
Utah     0.76  -2.20   1.47
Ohio    -0.11  -1.01  -1.09
Texas   -0.86  -0.68  -0.21
Oregon   0.77   1.14  -0.34

In [275]:
frame['e'].map(format_type)

Utah       1.47
Ohio      -1.09
Texas     -0.21
Oregon    -0.34
Name: e, dtype: object

## Sorting and Ranking

In [276]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [277]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [278]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [279]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [280]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [281]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [283]:
# Sorting with Nan
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2], index=[5, 4, 3, 2, 1, 6])
obj

5    4.0
4    NaN
3    7.0
2    NaN
1   -3.0
6    2.0
dtype: float64

In [285]:
# Sort by index
obj.sort_index()

1   -3.0
2    NaN
3    7.0
4    NaN
5    4.0
6    2.0
dtype: float64

In [287]:
# sort by values
obj.sort_values()

1   -3.0
6    2.0
5    4.0
3    7.0
4    NaN
2    NaN
dtype: float64

In [288]:
# Sort values by columns
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [292]:
frame.sort_values(by=['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [293]:
# Ranking
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [294]:
# Method first ranking as they are first observed in data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [295]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [297]:
# Dataframe to compute ranks
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [299]:
frame.rank(axis=1, method='max')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Datetime with Pandas

In [36]:

df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [37]:
df["new_date"] = pd.to_datetime(df["date"], format="%m/%d/%Y")

In [38]:
df

        date  value   new_date
0  3/10/2000      2 2000-03-10
1  3/11/2000      3 2000-03-11
2  3/12/2000      4 2000-03-12

In [48]:
# Accessing the datetime object
df.iloc[0]["new_date"].month

3

In [50]:
# create a month column - dt is the inbuild attribute to get day/months
df["month"] = df["new_date"].dt.month
df["day"] = df["new_date"].dt.day
df

        date  value   new_date  month  day
0  3/10/2000      2 2000-03-10      3   10
1  3/11/2000      3 2000-03-11      3   11
2  3/12/2000      4 2000-03-12      3   12

In [52]:
# dataframe with errored date
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [54]:
df['date'] = pd.to_datetime(df['date'], errors='ignore')
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [55]:
# assemble to datetime object if we have proper names for columns
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df['date'] = pd.to_datetime(df)
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

In [58]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 


df["day of week"] =df["date"].dt.dayofweek.map(dw_mapping)

In [59]:
df

   year  month  day       date day of week
0  2015      2    4 2015-02-04   Wednesday
1  2016      3    5 2016-03-05    Saturday

In [61]:
today = pd.to_datetime('today')
df['age'] = today.year - df['date'].dt.year
df

   year  month  day       date day of week  age
0  2015      2    4 2015-02-04   Wednesday    7
1  2016      3    5 2016-03-05    Saturday    6

In [98]:
# Load the sample sales data
sales_df = pd.read_csv("data/city_sales.csv")

In [99]:
sales_df.columns

Index(['date', 'num', 'city'], dtype='object')

In [100]:
sales_df.head()

                  date  num    city
0  2015-01-01 09:00:00    4  London
1  2015-01-01 09:01:00    4  London
2  2015-01-01 09:02:00    3  London
3  2015-01-01 09:03:00    3  London
4  2015-01-01 09:04:00    3  London

In [102]:
sales_df["date_obj"] = pd.to_datetime(sales_df["date"], format="%Y-%m-%d %H:%M:%S")

In [103]:
sales_df = sales_df.set_index(['date_obj'])

In [104]:
sales_df.head()

                                    date  num    city
date_obj
2015-01-01 09:00:00  2015-01-01 09:00:00    4  London
2015-01-01 09:01:00  2015-01-01 09:01:00    4  London
2015-01-01 09:02:00  2015-01-01 09:02:00    3  London
2015-01-01 09:03:00  2015-01-01 09:03:00    3  London
2015-01-01 09:04:00  2015-01-01 09:04:00    3  London

In [105]:
sales_df.shape

(1795144, 3)

In [106]:
sales_df.loc["2018"]

                                    date  num       city
date_obj
2018-01-01 09:00:00  2018-01-01 09:00:00    2     London
2018-01-01 09:01:00  2018-01-01 09:01:00    1     London
2018-01-01 09:02:00  2018-01-01 09:02:00    3     London
2018-01-01 09:03:00  2018-01-01 09:03:00    3     London
2018-01-01 09:04:00  2018-01-01 09:04:00    3     London
...                                  ...  ...        ...
2018-12-31 15:56:00  2018-12-31 15:56:00    4  Cambridge
2018-12-31 15:57:00  2018-12-31 15:57:00    2  Cambridge
2018-12-31 15:58:00  2018-12-31 15:58:00    3  Cambridge
2018-12-31 15:59:00  2018-12-31 15:59:00    3  Cambridge
2018-12-31 16:00:00  2018-12-31 16:00:00    2  Cambridge

[439524 rows x 3 columns]

In [110]:
sales_df.loc["2018-05-01 11"]

                                    date  num       city
date_obj
2018-05-01 11:00:00  2018-05-01 11:00:00    3     London
2018-05-01 11:01:00  2018-05-01 11:01:00    3     London
2018-05-01 11:02:00  2018-05-01 11:02:00    3     London
2018-05-01 11:03:00  2018-05-01 11:03:00    2     London
2018-05-01 11:04:00  2018-05-01 11:04:00    2     London
...                                  ...  ...        ...
2018-05-01 11:55:00  2018-05-01 11:55:00    1  Cambridge
2018-05-01 11:56:00  2018-05-01 11:56:00    3  Cambridge
2018-05-01 11:57:00  2018-05-01 11:57:00    2  Cambridge
2018-05-01 11:58:00  2018-05-01 11:58:00    3  Cambridge
2018-05-01 11:59:00  2018-05-01 11:59:00    2  Cambridge

[240 rows x 3 columns]

In [112]:
# 10 to 11 am sales
sales_df.loc['2018-5-2 10' : '2018-5-2 11' ]

                                    date  num       city
date_obj
2018-05-02 10:00:00  2018-05-02 10:00:00    2     London
2018-05-02 10:01:00  2018-05-02 10:01:00    3     London
2018-05-02 10:02:00  2018-05-02 10:02:00    4     London
2018-05-02 10:03:00  2018-05-02 10:03:00    4     London
2018-05-02 10:04:00  2018-05-02 10:04:00    4     London
...                                  ...  ...        ...
2018-05-02 11:55:00  2018-05-02 11:55:00    3  Cambridge
2018-05-02 11:56:00  2018-05-02 11:56:00    3  Cambridge
2018-05-02 11:57:00  2018-05-02 11:57:00    4  Cambridge
2018-05-02 11:58:00  2018-05-02 11:58:00    4  Cambridge
2018-05-02 11:59:00  2018-05-02 11:59:00    1  Cambridge

[480 rows x 3 columns]

In [115]:
# Groupby sales data on city
sales_df.groupby(['city']).agg({"num": sum})

               num
city
Cambridge  1257405
Durham     1257530
London     1256979
Oxford     1257188

## Groupby in Pandas

In [117]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000],
    'Duration':['30days','50days','35days','40days','60days','35days','55days','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
                })
df = pd.DataFrame(technologies, columns=['Courses','Fee','Duration','Discount'])

In [118]:
df.head()

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   35days      1000
3   Python  24000   40days      1200
4   Pandas  26000   60days      2500

In [119]:
df.shape

(8, 4)

In [120]:
# Using groupby() and count()
df2 = df.groupby(['Courses'])['Courses'].count()
print(df2)

Courses
Hadoop     2
Pandas     1
PySpark    1
Python     2
Spark      2
Name: Courses, dtype: int64

In [121]:
df.groupby(["Courses"]).agg({"Courses": 'count', "Fee": sum, "Discount": sum})

         Courses    Fee  Discount
Courses
Hadoop         2  48000      2300
Pandas         1  26000      2500
PySpark        1  25000      2300
Python         2  46000      2800
Spark          2  47000      2400

In [125]:
# get the duration in hours from the duration column
df["duration_time"] = df.Duration.str.extract('(\d+)')
df

   Courses    Fee Duration  Discount duration_time
0    Spark  22000   30days      1000            30
1  PySpark  25000   50days      2300            50
2   Hadoop  23000   35days      1000            35
3   Python  24000   40days      1200            40
4   Pandas  26000   60days      2500            60
5   Hadoop  25000   35days      1300            35
6    Spark  25000   55days      1400            55
7   Python  22000   50days      1600            50

In [128]:
df.groupby(["Courses"]).agg({"Courses": 'count', 'duration_time': sum})

         Courses duration_time
Courses
Hadoop         2          3535
Pandas         1            60
PySpark        1            50
Python         2          4050
Spark          2          3055

## Axis Indexes with Duplicate Labels

In [300]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [301]:
obj.index.is_unique

False

In [302]:
obj['a']

a    0
a    1
dtype: int64

In [304]:
obj['c']

4

In [305]:
# Dataframe with duplicate index
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [307]:
df.loc['b']

          0         1         2
b  0.559835 -1.243403  1.110916
b  1.138151 -0.369196 -1.156813

## Summarizing and Computing Descriptive Statistics

In [309]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [311]:
# Row-wise sum
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [313]:
# Column-wise sum
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [316]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [317]:
# idxmin and idxmax, return indirect statistics like the index value
df.idxmax()

one    b
two    d
dtype: object

In [318]:
df.idxmin()

one    d
two    b
dtype: object

In [321]:
# Cummulative sum
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [322]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [323]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance

In [327]:
!pip3 install pandas_datareader

Collecting pandas_datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 109.5/109.5 kB 1.4 MB/s eta 0:00:00[31m1.4 MB/s eta 0:00:01
Collecting lxml
  Downloading lxml-4.9.1-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (6.9 MB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 6.9/6.9 MB 16.8 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01
Collecting requests>=2.19.0
  Using cached requests-2.28.1-py3-none-any.whl (62 kB)
Requirement already satisfied: pandas>=0.23 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from pandas_datareader) (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from pandas>=0.23->pandas_datareader) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from pandas>=0.23->pandas_datareader) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from pandas>=0.23->pandas_datareader) (2022.6)
Collecting urllib3<1.27,>=1.21.1
  Downloading urllib3-1.26.13-py2.py3-none-any.whl (140 kB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 140.6/140.6 kB 33.1 MB/s eta 0:00:00
Collecting charset-normalizer<3,>=2
  Using cached charset_normalizer-2.1.1-py3-none-any.whl (39 kB)
Collecting certifi>=2017.4.17
  Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
     ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 155.3/155.3 kB 32.8 MB/s eta 0:00:00
Requirement already satisfied: idna<4,>=2.5 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from requests>=2.19.0->pandas_datareader) (3.4)
Requirement already satisfied: six>=1.5 in /home/arunachalamdharmaraj/Documents/training-repo/python/venv/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas>=0.23->pandas_datareader) (1.16.0)
Installing collected packages: urllib3, lxml, charset-normalizer, certifi, requests, pandas_datareader
Successfully installed certifi-2022.12.7 charset-normalizer-2.1.1 lxml-4.9.1 pandas_datareader-0.10.0 requests-2.28.1 urllib3-1.26.13

In [328]:
import pandas_datareader.data as web

In [329]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [331]:
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [333]:
price.head()

                 AAPL         IBM       MSFT       GOOG
Date
2017-12-11  41.047966  116.909363  80.262367  52.055000
2017-12-12  40.817371  117.909851  80.591949  52.023998
2017-12-13  40.952885  115.780991  80.375374  52.030499
2017-12-14  40.940990  115.848663  79.753830  52.457500
2017-12-15  41.357002  114.720230  81.787949  53.209499

In [335]:
volume.head()

                   AAPL         IBM        MSFT        GOOG
Date
2017-12-11  141095200.0   4291424.0  22857900.0  23856000.0
2017-12-12   77636800.0   6612603.0  23924100.0  25590000.0
2017-12-13   95273600.0   5922034.0  22062700.0  25654000.0
2017-12-14   81906000.0   4850720.0  19306000.0  31174000.0
2017-12-15  160677200.0  11798775.0  53936700.0  65518000.0

In [336]:
returns = price.pct_change()

In [337]:
returns.head()

                AAPL       IBM      MSFT      GOOG
Date
2017-12-11       NaN       NaN       NaN       NaN
2017-12-12 -0.005618  0.008558  0.004106 -0.000596
2017-12-13  0.003320 -0.018055 -0.002687  0.000125
2017-12-14 -0.000290  0.000584 -0.007733  0.008207
2017-12-15  0.010161 -0.009741  0.025505  0.014335

In [338]:
returns['MSFT'].corr(returns['IBM'])

0.4976286779443707

In [339]:
returns.corr

<bound method DataFrame.corr of                 AAPL       IBM      MSFT      GOOG
Date
2017-12-11       NaN       NaN       NaN       NaN
2017-12-12 -0.005618  0.008558  0.004106 -0.000596
2017-12-13  0.003320 -0.018055 -0.002687  0.000125
2017-12-14 -0.000290  0.000584 -0.007733  0.008207
2017-12-15  0.010161 -0.009741  0.025505  0.014335
...              ...       ...       ...       ...
2022-12-05 -0.007983 -0.008475 -0.018901 -0.009521
2022-12-06 -0.025370  0.000611 -0.020304 -0.025633
2022-12-07 -0.013785 -0.001559 -0.003060 -0.022197
2022-12-08  0.012133  0.003463  0.012399 -0.012612
2022-12-09 -0.003435 -0.004940 -0.008003 -0.009367

[1259 rows x 4 columns]>

In [340]:
## Unique Values, Value Counts, and Membership

In [341]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [342]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [343]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [345]:
pd.value_counts(obj.values, sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [4]:
### Create a DataFrame from CSV File
college_majors = pd.read_csv("./college-majors/all-ages.csv")
college_majors.head()

,Major_code,Major,Major_category,Total,Employed,Employed_full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th
0,1100,GENERAL AGRICULTURE,Agriculture & Natural Resources,128148,90245,74078,2423,0.026147,50000,34000,80000.0
1,1101,AGRICULTURE PRODUCTION AND MANAGEMENT,Agriculture & Natural Resources,95326,76865,64240,2266,0.028636,54000,36000,80000.0
2,1102,AGRICULTURAL ECONOMICS,Agriculture & Natural Resources,33955,26321,22810,821,0.030248,63000,40000,98000.0
3,1103,ANIMAL SCIENCES,Agriculture & Natural Resources,103549,81177,64937,3619,0.042679,46000,30000,72000.0
4,1104,FOOD SCIENCE,Agriculture & Natural Resources,24280,17281,12722,894,0.049188,62000,38500,90000.0

In [5]:
college_majors.shape

(173, 11)

In [6]:
college_majors.describe()

,Major_code,Total,Employed,Employed_full_time_year_round,Unemployed,Unemployment_rate,Median,P25th,P75th
count,173.000000,1.730000e+02,1.730000e+02,1.730000e+02,173.000000,173.000000,173.000000,173.000000,173.000000
mean,3879.815029,2.302566e+05,1.661620e+05,1.263078e+05,9725.034682,0.057355,56816.184971,38697.109827,82506.358382
std,1687.753140,4.220685e+05,3.073244e+05,2.424254e+05,18022.040192,0.019177,14706.226865,9414.524761,20805.330126
min,1100.000000,2.396000e+03,1.492000e+03,1.093000e+03,0.000000,0.000000,35000.000000,24900.000000,45800.000000
25%,2403.000000,2.428000e+04,1.728100e+04,1.272200e+04,1101.000000,0.046261,46000.000000,32000.000000,70000.000000
50%,3608.000000,7.579100e+04,5.656400e+04,3.961300e+04,3619.000000,0.054719,53000.000000,36000.000000,80000.000000
75%,5503.000000,2.057630e+05,1.428790e+05,1.110250e+05,8862.000000,0.069043,65000.000000,42000.000000,95000.000000
max,6403.000000,3.123510e+06,2.354398e+06,1.939384e+06,147261.000000,0.156147,125000.000000,78000.000000,210000.000000

## Combining DataFrame

<img src="combine_df.png" alt="combine-image">

In [15]:
## create two tables
student_dict = {
                "Roll No": [1, 2, 3, 4, 5, 6, 7],
                "Name": ["Arun", "Babu", "Chander", "Dinesh", "Ezhil", "Farzana", "Giri"],
                "Department": ["CSE", "CSE", "IT", "IT", "CSE", "MECH", "CIVIL"]
             }

placement_dict = {
    "Roll No": [1, 2, 3, 4, 5, 6],
    "Flag": [True, True, False, True, True, False]
}

In [16]:
student_df = pd.DataFrame(student_dict)
placement_df = pd.DataFrame(placement_dict)

In [17]:
student_df

   Roll No     Name Department
0        1     Arun        CSE
1        2     Babu        CSE
2        3  Chander         IT
3        4   Dinesh         IT
4        5    Ezhil        CSE
5        6  Farzana       MECH
6        7     Giri      CIVIL

In [18]:
placement_df

   Roll No   Flag
0        1   True
1        2   True
2        3  False
3        4   True
4        5   True
5        6  False

In [19]:
# Merge left join
left_df = pd.merge(student_df, placement_df, on="Roll No", how="left")
left_df

   Roll No     Name Department   Flag
0        1     Arun        CSE   True
1        2     Babu        CSE   True
2        3  Chander         IT  False
3        4   Dinesh         IT   True
4        5    Ezhil        CSE   True
5        6  Farzana       MECH  False
6        7     Giri      CIVIL    NaN

In [20]:
right_df = pd.merge(student_df, placement_df, on="Roll No", how="right")
right_df

   Roll No     Name Department   Flag
0        1     Arun        CSE   True
1        2     Babu        CSE   True
2        3  Chander         IT  False
3        4   Dinesh         IT   True
4        5    Ezhil        CSE   True
5        6  Farzana       MECH  False

In [22]:
outer_df = pd.merge(student_df, placement_df, on="Roll No", how="outer")
outer_df

   Roll No     Name Department   Flag
0        1     Arun        CSE   True
1        2     Babu        CSE   True
2        3  Chander         IT  False
3        4   Dinesh         IT   True
4        5    Ezhil        CSE   True
5        6  Farzana       MECH  False
6        7     Giri      CIVIL    NaN

In [23]:
inner_df = pd.merge(student_df, placement_df, on="Roll No", how="inner")
inner_df

   Roll No     Name Department   Flag
0        1     Arun        CSE   True
1        2     Babu        CSE   True
2        3  Chander         IT  False
3        4   Dinesh         IT   True
4        5    Ezhil        CSE   True
5        6  Farzana       MECH  False

In [30]:
# get names of the student got placed from CSE
inner_df.loc[(inner_df.Department == "CSE") & (inner_df.Flag == True)][["Roll No", "Name"]]

   Roll No   Name
0        1   Arun
1        2   Babu
4        5  Ezhil

## Groupby

In [34]:
# Attended interview by grouping by Department
student_df.groupby(["Department"]).count()["Name"]

Department
CIVIL    1
CSE      3
IT       2
MECH     1
Name: Name, dtype: int64

In [36]:
student_df.groupby(["Department", "Name"]).count()

                    Roll No
Department Name
CIVIL      Giri           1
CSE        Arun           1
           Babu           1
           Ezhil          1
IT         Chander        1
           Dinesh         1
MECH       Farzana        1